# -*- coding: utf-8 -*-
# @Time    : 2019/1/21 20:06
# @Author  : lemon_huahua
# @Email   : 204893985@qq.com
# @File    : task_循环2道题.py
# 6:利用for循环，完成a=[1,7,4,89,34,2]的冒泡排序：
# 冒泡排序：小的排前面，大的排后面。
# a=[1,7,4,89,34,2]
# 内置函数解决
# a.sort(reverse=True)#排序
# print(a)

# 利用for循环去解决 冒泡排序最多是会执行n-1次  n是元素的个数
# a=[1,7,4,89,34,2]
# for j in range(len(a)-1):
#     for i in range(len(a)-1):#0 1 2 3 4
#         if a[i]>a[i+1]:#a[i] 遍历取得每一个元素  a[i+1] 是a[i]相邻的元素
#             a[i],a[i+1]=a[i+1],a[i]#赋值运算
#     print('排序之后的列表a的值:',a)
# 第一轮：
# i=0  i+1=1   a[0]=1  a[1]=7
# i=1  i+1=2   a[1]=4  a[2]=7  [1,4,7,89,34,2]
# i=2  i+1=3   a[2]=7  a[3]=89
# i=3  i+1=4   a[3]=34 a[4]=89 [1,4,7,34,89,2]
# i=4  i+1=5   a[4]=2  a[5]=89  [1,4,7,34,2,89]

# 第2轮：[1,4,7,34,2,89]
# i=0  i+1=1   a[0]=1  a[1]=4
# i=1  i+1=2   a[1]=4  a[2]=7
# i=2  i+1=3   a[2]=7  a[3]=34
# i=3  i+1=4   a[3]=34 a[4]=2 [1,4,7,2,34,89]
# i=4  i+1=5   a[4]=34  a[5]=89

# 第3轮：[1,4,7,2,34,89]
# i=0  i+1=1   a[0]=1  a[1]=4
# i=1  i+1=2   a[1]=4  a[2]=7
# i=2  i+1=3   a[2]=7  a[3]=2 [1,4,2,7,34,89]
# i=3  i+1=4   a[3]=7  a[4]=34
# i=4  i+1=5   a[4]=34  a[5]=89

# 第4轮：[1,4,2,7,34,89]
# i=0  i+1=1   a[0]=1  a[1]=4
# i=1  i+1=2   a[1]=4  a[2]=2 [1,2,4,7,34,89]
# i=2  i+1=3   a[2]=4  a[3]=7
# i=3  i+1=4   a[3]=7  a[4]=34
# i=4  i+1=5   a[4]=34  a[5]=89

# 第5轮：[1,2,4,7,34,89]
# i=0  i+1=1   a[0]=1  a[1]=2
# i=1  i+1=2   a[1]=2  a[2]=4
# i=2  i+1=3   a[2]=4  a[3]=7
# i=3  i+1=4   a[3]=7  a[4]=34
# i=4  i+1=5   a[4]=34  a[5]=89

# 第6轮：[1,2,4,7,34,89]
# i=0  i+1=1   a[0]=1  a[1]=2
# i=1  i+1=2   a[1]=2  a[2]=4
# i=2  i+1=3   a[2]=4  a[3]=7
# i=3  i+1=4   a[3]=7  a[4]=34
# i=4  i+1=5   a[4]=34  a[5]=89

# python 里面可以连续赋值
# a,b,c=1,2,3
# # print(a,b,c)
# a=1
# b=6

# 引入中间变量
# c=a#赋值运算 右边的值赋值给左边
# a=b
# b=c

# print(a)
# print(b)

# 7:有1 2 3 4 这四个数字，能组成多少个互不相同且无重复数字的三位数？分别是什么？
# 123 123 123  111 222 121 131 122
count = 0  # 记录符合条件的数据个数
L = []  # 存储符合条件的的数字
for i in range(1, 5):  # 个位数
    for j in range(1, 5):  # j 十位数
        for k in range(1, 5):  # 百位数
            if i != j and j != k and i != k:
                a = k * 100 + j * 10 + i
                count += 1
                L.append(a)
print('满足条件的数字个数是：', count)
print('满足条件的数字分别是：', L)
