# -*- coding: utf-8 -*-
# @Time    : 2019/1/14 13:46
# @Author  : lemon_huahua
# @Email   : 204893985@qq.com
# @File    : read_me.py
#1-21
#2个循环的作业讲解
#2个函数的作业讲解
#os路径操作

#1-23
#2个循环的作业讲解
#2个函数的作业讲解
#1：Python文件的处理

#年后
#2:模块的导入import的几种用法
#2:异常处理
#3：调试方法和技巧
#1：类与对象
#2:类的不同类型的函数：类方法 静态方法 对象方法 初始化函数等
#3:类的继承

#1-24号开始放假（请各位根据老师留下的预习视频，做好预习）

# for i in [1,2,3,4,5]:
#     print('*'*i,end='')#
#     print()

for j in [4,3,2,1,0]:
    print(' '*(j),end='')
    print(' * '*(5-j),end='')
    print()
# for i in [1,2,3,4,5]:
#     print('* '*i,end='')
#     print()

# @@@@*
# @@@* *
# @@* * *
# @* * * *
# * * * * *