# -*- coding: utf-8 -*-
# @Time    : 2019/1/16 20:04
# @Author  : lemon_huahua
# @Email   : 204893985@qq.com
# @File    : task_0109.py
# 3：利用for循环输出如下三角形
# *
# **
# ***
# ****
# *****
# for i in [1,2,3,4,5]:
#     print('*'*i)

# for i in range(1,6):
#     print('*'*i)
#range函数 生成指定的整数序列  可迭代的数据类型 切片相似
#range(m,n,k) m：开头，默认值是0  n结尾 k 步长 k的 默认值=1
#取左不取右/取头不取尾
# print(list(range(5)))#方便你们观察结果是否正确
# range()函数生成的整数序列 就是可迭代的

#利用for循环完成1-100的整数和相加
# sum=0#存储1-100的整数和
# for i in range(1,101):
#     # print(i)
#     sum+=i
#     # print(sum) 放在这里的话 就会打印很多次！
# print(sum)

# 4：请用嵌套for循环输
# 出如下等边三角形（三个边均为5个*）
#@@@@*
#@@@* *
#@@* * *
#@* * * *
#* * * * *
# for i in range(1,6):#i=1
#     for j in range(0,5-i):#j=0 1 2 3
#         print('@',end='')#end='' 就是不换行输出
#     print('* '*i)

# 5:输出99乘法表
#1*1=1 # i=1  j=1
#1*2=2 2*2=4 # 2 j= 1 2
#1*3=3 2*3=6  3*3=9 # 3 j=1 2 3
#1*4=4 2*4=8  3*4=12  4*4=16 #4 j=1 2 3 4
#1*5=5 2*5=10 3*5=15  4*5=20 5*5=25 #5 j= 1 2 3 4 5
#1*6=6 2*6=12 3*6=18  4*6=24 5*6=30 6*6=36#6 j=1 2 3 4 5 6
for i in range(1,10):#i 控制了我们的行数 6行 1,2,3,4,5,6
    for j in range(1,i+1):# 1 2 3
    #i=1 j=1
    #i=2 j=1 2
    #i=3 j=1 2 3
    #i=4 j=1 2 3 4
        print('{}*{}={}'.format(i,j,i*j),end=' ')
    print()#换行的操作


